; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-32)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
)
)
)

; plan
1. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 24 of 32
2. (pick ball7 rooma right)
   deleted: (at ball7 rooma) (free right)
   added: (carry ball7 right)
   goals met: 24 of 32
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 32
4. (drop ball7 roomb right)
   deleted: (carry ball7 right)
   added: (at ball7 roomb) (free right)
   goals met: 25 of 32
5. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 26 of 32
6. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 26 of 32
7. (pick ball14 roomb right)
   deleted: (at ball14 roomb) (free right)
   added: (carry ball14 right)
   goals met: 26 of 32
8. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 26 of 32
9. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 27 of 32
10. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 28 of 32
11. (pick ball19 room3 left)
   deleted: (at ball19 room3) (free left)
   added: (carry ball19 left)
   goals met: 28 of 32
12. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 28 of 32
13. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 29 of 32
14. (pick ball25 room4 right)
   deleted: (at ball25 room4) (free right)
   added: (carry ball25 right)
   goals met: 29 of 32
15. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 29 of 32
16. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 29 of 32
17. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 29 of 32
18. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 30 of 32
19. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 30 of 32
20. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 30 of 32
21. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 30 of 32
22. (drop ball25 room5 right)
   deleted: (carry ball25 right)
   added: (at ball25 room5) (free right)
   goals met: 31 of 32
23. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 31 of 32
24. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 32 of 32
